In [8]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from bs4 import BeautifulSoup
import requests
from time import sleep
from tqdm.notebook import tqdm
import sys

%matplotlib inline

In [9]:
df = pd.read_csv('file(1).csv')
df.head(5)

     Series ID  Year Period     Label  Value
0  CUUR0000SA0  1958    M01  1958 Jan   28.6
1  CUUR0000SA0  1958    M02  1958 Feb   28.6
2  CUUR0000SA0  1958    M03  1958 Mar   28.8
3  CUUR0000SA0  1958    M04  1958 Apr   28.9
4  CUUR0000SA0  1958    M05  1958 May   28.9

In [10]:
df2 = df.groupby('Year').mean()
df2

           Value
Year
1958   28.858333
1959   29.150000
1960   29.575000
1961   29.891667
1962   30.250000
...          ...
2018  251.106833
2019  255.657417
2020  258.811167
2021  270.969750
2022  285.369250

[65 rows x 1 columns]

In [11]:
def inflrate(value):
    return ((285.369250 - value) / value) + 1

In [12]:
df2.Value = df2.Value.apply(inflrate)

In [16]:
df2 = df2.reset_index(level=0)
df2 = df2[['Year', 'Value']]
df2

    Year     Value
0   1958  9.888625
1   1959  9.789683
2   1960  9.649003
3   1961  9.546783
4   1962  9.433694
..   ...       ...
60  2018  1.136446
61  2019  1.116217
62  2020  1.102616
63  2021  1.053141
64  2022  1.000000

[65 rows x 2 columns]

In [17]:
df2.to_csv('infrate.csv', index=False)